apache/mynewt-core/hw/drivers/i2s/i2s_stm32f4/src/i2s_stm32f4.c
    tmp1 = hi2s->Instance->I2SCFGR & (SPI_I2SCFGR_DATLEN | SPI_I2SCFGR_CHLEN);
    /*
     * Check the Data format: When a 16-bit data frame or a 16-bit data frame extended
     * is selected during the I2S configuration phase, the Size parameter means the number
     * of 16-bit data length in the transaction and when a 24-bit data frame or a 32-bit data
     * frame is selected the Size parameter means the number of 16-bit data length.
     */
    if ((tmp1 == I2S_DATAFORMAT_24B) || (tmp1 == I2S_DATAFORMAT_32B)) {
        size = sample_count << 1U;
    } else {
        size = sample_count;
    }
    hi2s->TxXferSize = size;
    hi2s->TxXferCount = size;
    hi2s->RxXferSize = size;
    hi2s->RxXferCount = size;

    hi2s->ErrorCode = HAL_I2S_ERROR_NONE;
    hi2s->State = HAL_I2S_STATE_BUSY_TX_RX;

    /* No Half transfer needed */
    hi2s->hdmarx->XferHalfCpltCallback = NULL;
    hi2s->hdmatx->XferHalfCpltCallback = NULL;

    /* Set the I2S Rx DMA transfer complete callback */
    hi2s->hdmarx->XferCpltCallback = i2s_dma_m0_complete;
    hi2s->hdmarx->XferM1CpltCallback = i2s_dma_m1_complete;

    /* Set the I2S Rx DMA error callback */
    hi2s->hdmarx->XferErrorCallback = i2s_dma_error;

    hi2s->hdmarx->Instance->CR &= ~DMA_SxCR_CT_Msk;

    /* Set the I2S Tx DMA transfer complete callback */
    hi2s->hdmatx->XferCpltCallback = i2s_dma_mx_complete_ignore;
    hi2s->hdmatx->XferM1CpltCallback = i2s_dma_mx_complete_ignore;

    /* Set the I2S Tx DMA error callback */
    hi2s->hdmatx->XferErrorCallback = i2s_dma_error;

    hi2s->hdmatx->Instance->CR &= ~DMA_SxCR_CT_Msk;

    tmp1 = hi2s->Instance->I2SCFGR & SPI_I2SCFGR_I2SCFG;
    /* Check if the I2S_MODE_MASTER_TX or I2S_MODE_SLAVE_TX Mode is selected */
    if ((tmp1 == I2S_MODE_MASTER_TX) || (tmp1 == I2S_MODE_SLAVE_TX)) {
        /* Enable the Rx DMA Stream */
        HAL_DMAEx_MultiBufferStart_IT(hi2s->hdmarx, (uint32_t)&I2SxEXT(hi2s->Instance)->DR,
                                      (uint32_t)buf0, (uint32_t)buf1, size);

        /* Enable Rx DMA Request */
        SET_BIT(I2SxEXT(hi2s->Instance)->CR2, SPI_CR2_RXDMAEN);

        /* Enable the Tx DMA Stream */
        HAL_DMAEx_MultiBufferStart_IT(hi2s->hdmatx, (uint32_t)buf0, (uint32_t)&hi2s->Instance->DR,
                                      (uint32_t)buf1, size);

        /* Enable Tx DMA Request */
        SET_BIT(hi2s->Instance->CR2, SPI_CR2_TXDMAEN);

        /* Check if the I2S is already enabled */
        if ((hi2s->Instance->I2SCFGR & SPI_I2SCFGR_I2SE) != SPI_I2SCFGR_I2SE) {
            /* Enable I2Sext(receiver) before enabling I2Sx peripheral */
            __HAL_I2SEXT_ENABLE(hi2s);

            /* Enable I2S peripheral after the I2Sext */
            __HAL_I2S_ENABLE(hi2s);
        }
    } else {
        /* Check if Master Receiver mode is selected */
        if ((hi2s->Instance->I2SCFGR & SPI_I2SCFGR_I2SCFG) == I2S_MODE_MASTER_RX) {
            /*
             * Clear the Overrun Flag by a read operation on the SPI_DR register followed by a read
             * access to the SPI_SR register.
             */
            __HAL_I2S_CLEAR_OVRFLAG(hi2s);
        }
        /* Enable the Tx DMA Stream */
        HAL_DMAEx_MultiBufferStart_IT(hi2s->hdmatx, (uint32_t)buf0, (uint32_t)&I2SxEXT(hi2s->Instance)->DR,
                                      (uint32_t)buf1, size);

        /* Enable Tx DMA Request */
        SET_BIT(I2SxEXT(hi2s->Instance)->CR2, SPI_CR2_TXDMAEN);

        /* Enable the Rx DMA Stream */
        HAL_DMAEx_MultiBufferStart_IT(hi2s->hdmarx, (uint32_t)&hi2s->Instance->DR, (uint32_t)buf0,
                                      (uint32_t)buf1, size);

        /* Enable Rx DMA Request */
        SET_BIT(hi2s->Instance->CR2, SPI_CR2_RXDMAEN);

        /* Check if the I2S is already enabled */
        if ((hi2s->Instance->I2SCFGR & SPI_I2SCFGR_I2SE) != SPI_I2SCFGR_I2SE) {
            /* Enable I2Sext(transmitter) before enabling I2Sx peripheral */
            __HAL_I2SEXT_ENABLE(hi2s);
            /* Enable I2S peripheral before the I2Sext */
            __HAL_I2S_ENABLE(hi2s);
        }
    }

error:
    __HAL_UNLOCK(hi2s);
    return errorcode;
}
#endif

int
i2s_driver_start(struct i2s *i2s)
{
    int rc = 0;
    struct stm32_i2s *i2s_data = (struct stm32_i2s *)i2s->driver_data;

    switch (i2s_data->hi2s.State) {
    case HAL_I2S_STATE_RESET:
        if (i2s->sample_rate) {
            i2s_data->hi2s.Init.AudioFreq = i2s->sample_rate;
        }
        if (HAL_I2S_Init(&i2s_data->hi2s) != HAL_OK) {
            rc = SYS_EUNKNOWN;
            break;
        }
        if (HAL_DMA_Init(i2s_data->hdma_spi) != HAL_OK) {
            (void)HAL_I2S_DeInit(&i2s_data->hi2s);
            rc = SYS_EUNKNOWN;
            break;
        }
#if I2S_FULLDUPLEX_SUPPORT
        if (i2s->direction == I2S_OUT_IN) {
            if (HAL_DMA_Init(i2s_data->hdma_i2sext) != HAL_OK) {
                (void)HAL_DMA_DeInit(i2s_data->hdma_spi);
                (void)HAL_I2S_DeInit(&i2s_data->hi2s);
                rc = SYS_EUNKNOWN;
                break;
            }
        }
#endif
    /* Fallthrough */
    case HAL_I2S_STATE_READY:
        assert(i2s_data->dma_buffers[0] == NULL);
        assert(i2s_data->dma_buffers[1] == NULL);
        assert(i2s_data->dma_buffer_count == 0);
        i2s_data->dma_buffers[0] = i2s_driver_buffer_get(i2s);
        i2s_data->dma_buffers[1] = i2s_driver_buffer_get(i2s);
        if (i2s_data->dma_buffers[0] == NULL) {
            i2s->state = I2S_STATE_OUT_OF_BUFFERS;
            rc = I2S_ERR_NO_BUFFER;
            break;
        }
        if (i2s_data->dma_buffers[1] == NULL) {
            i2s_data->dma_buffers[1] = i2s_data->dma_buffers[0];
            i2s_data->dma_buffer_count = 1;
        } else {
            i2s_data->dma_buffer_count = 2;
        }
        i2s->state = I2S_STATE_RUNNING;
        if (i2s->direction == I2S_IN) {
            i2s_data->dma_buffers[0]->sample_count = i2s_data->dma_buffers[0]->capacity;
            assert(i2s_data->dma_buffers[0]->capacity == i2s_data->dma_buffers[1]->capacity);
            i2s_receive_start_dma(&i2s_data->hi2s, i2s_data->dma_buffers[0]->sample_data,
                                  i2s_data->dma_buffers[1]->sample_data, i2s_data->dma_buffers[0]->sample_count);
        } else if (i2s->direction == I2S_OUT) {
            i2s_transmit_start_dma(&i2s_data->hi2s,
                                   i2s_data->dma_buffers[0]->sample_data,
                                   i2s_data->dma_buffers[1]->sample_data,
                                   i2s_data->dma_buffers[0]->sample_count);
        } else {
#if I2S_FULLDUPLEX_SUPPORT
            i2s_transmit_receive_dma(&i2s_data->hi2s,
                                     i2s_data->dma_buffers[0]->sample_data,
                                     i2s_data->dma_buffers[1]->sample_data,
                                     i2s_data->dma_buffers[0]->sample_count);
#endif
        }
        break;
    case HAL_I2S_STATE_BUSY:
    case HAL_I2S_STATE_BUSY_RX:
    case HAL_I2S_STATE_BUSY_TX:
    case HAL_I2S_STATE_BUSY_TX_RX:
        break;
    default:
        rc = I2S_ERR_INTERNAL;
    }
    return rc;
}

void
i2s_driver_buffer_queued(struct i2s *i2s)
{
    struct stm32_i2s *i2s_data = (struct stm32_i2s *)i2s->driver_data;
    struct i2s_sample_buffer *next_buffer;
    int sr;
    int inactive_memory_buffer_ix;
    uint32_t sample_buffer_addr;

    if (i2s->state != I2S_STATE_RUNNING) {
        return;
    }
    OS_ENTER_CRITICAL(sr);
    switch (i2s_data->dma_buffer_count) {
    case 0:
        i2s_data->dma_buffers[0] = i2s_driver_buffer_get(i2s);
        i2s_data->dma_buffer_count = 1;
        break;
    case 1:
        next_buffer = i2s_driver_buffer_get(i2s);
        if ((i2s_data->hdma_spi->Instance->CR & DMA_SxCR_EN) == 0) {
            i2s_data->dma_buffers[1] = next_buffer;
        } else {
            sample_buffer_addr = (uint32_t)next_buffer->sample_data;
            /* DMA is active with just one buffer, inactive buffer needs to be changed. */
            inactive_memory_buffer_ix = (i2s_data->hdma_spi->Instance->CR & DMA_SxCR_CT_Msk) ? 0 : 1;
            HAL_DMAEx_ChangeMemory(i2s_data->hdma_spi, sample_buffer_addr,
                                   inactive_memory_buffer_ix ? MEMORY1 : MEMORY0);
            if ((i2s_data->hdma_spi->Instance->CR & DMA_SxCR_EN_Msk) == 0) {
                /*
                 * There was race between checking current buffer and settings next.
                 * In this case M1AR or M0AR was write protected and write did not succeeded,
                 * Just write the other memory address.
                 */
                inactive_memory_buffer_ix ^= 1;
                HAL_DMAEx_ChangeMemory(i2s_data->hdma_spi, sample_buffer_addr,
                                       inactive_memory_buffer_ix ? MEMORY1 : MEMORY0);

